-- phpMyAdmin SQL Dump
-- version 5.2.1
-- https://www.phpmyadmin.net/
--
-- Хост: mysql-8.4
-- Время создания: Ноя 13 2025 г., 14:36
-- Версия сервера: 8.4.6
-- Версия PHP: 8.4.12

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- База данных: `time`
--

-- --------------------------------------------------------

--
-- Структура таблицы `employees`
--

CREATE TABLE `employees` (
  `id` int NOT NULL,
  `full_name` varchar(100) NOT NULL,
  `phone` varchar(15) NOT NULL,
  `password_hash` varchar(255) NOT NULL,
  `role` enum('admin','director','senior_nurse','employee') NOT NULL,
  `position` varchar(50) DEFAULT NULL,
  `department` varchar(50) DEFAULT NULL,
  `hire_date` date DEFAULT NULL,
  `created_at` timestamp NULL DEFAULT CURRENT_TIMESTAMP,
  `updated_at` timestamp NULL DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP,
  `gender` enum('male','female') DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;

--
-- Дамп данных таблицы `employees`
--

INSERT INTO `employees` (`id`, `full_name`, `phone`, `password_hash`, `role`, `position`, `department`, `hire_date`, `created_at`, `updated_at`, `gender`) VALUES
(2, 'Администратор', '79991234567', '$2y$12$lHUMcoOpHAuB0jb2vYeiK.Ep51Pegv/tGXJ9bTGY74FBbsPVTBy8K', 'admin', 'Системный администратор', 'IT', '2024-01-01', '2025-11-10 05:37:14', '2025-11-12 05:28:11', 'male'),
(119, 'Евсеев Иван Григорьевич', '79027235285', '$2y$12$u8PB3Uw75Vzr4yWlFAOLPeV650iW41PlIH27R96nZaWctW/gz82Ra', 'employee', 'sanitar', 'floor_2', NULL, '2025-11-12 18:36:30', '2025-11-12 18:36:30', 'male'),
(120, 'Ефремов Андрей Глебович', '79027141505', '$2y$12$JahuDwBKfcSerARy/ulDleq6NQDguIifGdZ6EiITYCTwCxS60wux2', 'employee', 'sanitar', 'floor_2', NULL, '2025-11-12 18:36:30', '2025-11-12 18:36:30', 'male'),
(121, 'Колесников Михаил Маркович', '79026090729', '$2y$12$/Twq3D9WJz.XWa05GtPCoORHyl9yw3Y0kxkMT3AgqTvQF3unAF5Sy', 'employee', 'sanitar', 'floor_2', NULL, '2025-11-12 18:36:31', '2025-11-12 18:36:31', 'male'),
(122, 'Соболев Александр Михайлович', '79021661903', '$2y$12$RjkalvhOAkB9kvK3xmi.furH.sGNbwBXyEGrPeLLacIwqS5USc0cG', 'employee', 'sanitar', 'floor_2', NULL, '2025-11-12 18:36:31', '2025-11-12 18:36:31', 'male'),
(123, 'Бычков Илья Демидович', '79023626476', '$2y$12$I7xiWCSK1aDiO7wFwo0VSuNf9B2O2Aasu3eCyh.A5c8lnvDTWZgTi', 'employee', 'sanitar', 'floor_2', NULL, '2025-11-12 18:36:53', '2025-11-12 18:36:53', 'male'),
(124, 'Марков Иван Макарович', '79029044196', '$2y$12$TGceNrm.oxbTP4WvDTlK6e/p0FQNb3DjLqKgt.KyI6tsuo4RqFY0e', 'employee', 'sanitar', 'floor_2', NULL, '2025-11-12 18:36:31', '2025-11-12 18:36:31', 'male'),
(125, 'Третьяков Кирилл Ильич', '79029686886', '$2y$12$36QhYgwurS0lzOQuHWJ/sOMRFw65XNJH.1Fyg4uEBjMo5WQ6oDA4y', 'employee', 'sanitar', 'floor_2', NULL, '2025-11-12 18:36:31', '2025-11-12 18:36:31', 'male'),
(126, 'Калашников Роман Иванович', '79025324351', '$2y$12$N.H46n6dta4lj0ZTZELP7.ImqPXhPptbHOLP2t2uKFvBmRtfCyJKO', 'employee', 'sanitar', 'floor_2', NULL, '2025-11-12 18:36:32', '2025-11-12 18:36:32', 'male'),
(127, 'Крылов Александр Евгеньевич', '79021326089', '$2y$12$ffOsJ1CbaYs/QKXUX/U.6edkRx/AcjMPqqttVDNXPBKoE.lDyXkJ2', 'employee', 'sanitar', 'floor_2', NULL, '2025-11-12 18:36:32', '2025-11-12 18:36:32', 'male'),
(128, 'Цветков Егор Вячеславович', '79029340219', '$2y$12$FJkMfFpIvHMpEZLRHfwTLOnzIuFV2VtqiX1kyBngCRJlssJr5sdge', 'employee', 'sanitar', 'floor_2', NULL, '2025-11-12 18:36:32', '2025-11-12 18:36:32', 'male'),
(129, 'Макаров Артём Никитич', '79027896656', '$2y$12$c9.10zFBYMeJLMHIpxi.9uOcKM4UwVAOpPxgLGXAWpJoFnCrus34C', 'employee', 'sanitar', 'floor_1', NULL, '2025-11-12 18:36:32', '2025-11-12 18:36:32', 'male'),
(130, 'Смирнов Никита Леонович', '79029872489', '$2y$12$4PBtI52YBcB7.ZlunyeJ4OepyxTt6jYa38C31AnnXsTZltOcWW9Ta', 'employee', 'sanitar', 'floor_1', NULL, '2025-11-12 18:37:02', '2025-11-12 18:37:02', 'male'),
(131, 'Егоров Матвей Алексеевич', '79021222022', '$2y$12$tPUAtVdsuWC8g0qjC1IiEOJ4Hxb1753fDGomneW58T0mYaD.f8LUe', 'employee', 'sanitar', 'floor_1', NULL, '2025-11-12 18:36:33', '2025-11-12 18:36:33', 'male'),
(132, 'Терентьев Константин Максимович', '79026709801', '$2y$12$bt4hLK5CXyNYJuEDK9235eYJIn2fLW/44INVMMnQkTagUVYAUc8M2', 'employee', 'sanitar', 'floor_1', NULL, '2025-11-12 18:36:33', '2025-11-12 18:36:33', 'male'),
(133, 'Новиков Савва Артёмович', '79028125687', '$2y$12$GfGgR98SV9L50EK6gqHD8.RbCw6Oyye4MtXclZJPKLYFfzo4uth/K', 'employee', 'sanitar', 'floor_1', NULL, '2025-11-12 18:36:58', '2025-11-12 18:36:58', 'male'),
(134, 'Федоров Елисей Никитич', '79027591387', '$2y$12$J2AJHnsAUAmUlcI7ojPKiu5Yngj92Ig3FC5upcsTAqDN3gwsNY.r.', 'employee', 'assistant', 'general', NULL, '2025-11-12 18:36:34', '2025-11-12 18:36:34', 'male'),
(135, 'Васильев Олег Степанович', '79020081301', '$2y$12$i/Dj/LsRqBM2Gvm7F1fqXOlzHf/bofndvOIDqGMDR4bPEsTcKIwka', 'employee', 'assistant', 'general', NULL, '2025-11-12 18:36:34', '2025-11-12 18:36:34', 'male');

-- --------------------------------------------------------

--
-- Структура таблицы `schedule`
--

CREATE TABLE `schedule` (
  `id` int NOT NULL,
  `employee_id` int NOT NULL,
  `date` date NOT NULL,
  `shift_type` varchar(10) DEFAULT 'off',
  `created_at` timestamp NULL DEFAULT CURRENT_TIMESTAMP
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;

--
-- Дамп данных таблицы `schedule`
--

INSERT INTO `schedule` (`id`, `employee_id`, `date`, `shift_type`, `created_at`) VALUES
(845, 133, '2025-11-02', '10ч', '2025-11-13 04:40:18'),
(846, 133, '2025-11-03', '14ч', '2025-11-13 04:40:18'),
(847, 133, '2025-11-07', '10ч', '2025-11-13 04:40:18'),
(848, 133, '2025-11-08', '14ч', '2025-11-13 04:40:18'),
(849, 133, '2025-11-12', '10ч', '2025-11-13 04:40:18'),
(850, 133, '2025-11-13', '14ч', '2025-11-13 04:40:18'),
(851, 133, '2025-11-17', '10ч', '2025-11-13 04:40:18'),
(852, 133, '2025-11-18', '14ч', '2025-11-13 04:40:18'),
(853, 133, '2025-11-22', '10ч', '2025-11-13 04:40:19'),
(854, 133, '2025-11-23', '14ч', '2025-11-13 04:40:19'),
(855, 133, '2025-11-27', '10ч', '2025-11-13 04:40:19'),
(856, 133, '2025-11-28', '14ч', '2025-11-13 04:40:19'),
(857, 131, '2025-11-03', '10ч', '2025-11-13 04:40:19'),
(858, 131, '2025-11-04', '14ч', '2025-11-13 04:40:19'),
(859, 131, '2025-11-08', '10ч', '2025-11-13 04:40:19'),
(860, 131, '2025-11-09', '14ч', '2025-11-13 04:40:19'),
(861, 131, '2025-11-13', '10ч', '2025-11-13 04:40:19'),
(862, 131, '2025-11-14', '14ч', '2025-11-13 04:40:19'),
(863, 131, '2025-11-18', '10ч', '2025-11-13 04:40:19'),
(864, 131, '2025-11-19', '14ч', '2025-11-13 04:40:19'),
(865, 131, '2025-11-23', '10ч', '2025-11-13 04:40:19'),
(866, 131, '2025-11-24', '14ч', '2025-11-13 04:40:19'),
(867, 131, '2025-11-28', '10ч', '2025-11-13 04:40:19'),
(868, 131, '2025-11-29', '14ч', '2025-11-13 04:40:19'),
(869, 132, '2025-11-04', '10ч', '2025-11-13 04:40:19'),
(870, 132, '2025-11-05', '14ч', '2025-11-13 04:40:19'),
(871, 132, '2025-11-09', '10ч', '2025-11-13 04:40:19'),
(872, 132, '2025-11-10', '14ч', '2025-11-13 04:40:19'),
(873, 132, '2025-11-14', '10ч', '2025-11-13 04:40:19'),
(874, 132, '2025-11-15', '14ч', '2025-11-13 04:40:19'),
(875, 132, '2025-11-19', '10ч', '2025-11-13 04:40:19'),
(876, 132, '2025-11-20', '14ч', '2025-11-13 04:40:19'),
(877, 132, '2025-11-24', '10ч', '2025-11-13 04:40:19'),
(878, 132, '2025-11-25', '14ч', '2025-11-13 04:40:19'),
(879, 132, '2025-11-29', '10ч', '2025-11-13 04:40:19'),
(880, 132, '2025-11-30', '14ч', '2025-11-13 04:40:19'),
(881, 129, '2025-11-01', '14ч', '2025-11-13 04:40:20'),
(882, 129, '2025-11-05', '10ч', '2025-11-13 04:40:20'),
(883, 129, '2025-11-06', '14ч', '2025-11-13 04:40:20'),
(884, 129, '2025-11-10', '10ч', '2025-11-13 04:40:20'),
(885, 129, '2025-11-11', '14ч', '2025-11-13 04:40:20'),
(886, 129, '2025-11-15', '10ч', '2025-11-13 04:40:20'),
(887, 129, '2025-11-16', '14ч', '2025-11-13 04:40:20'),
(888, 129, '2025-11-20', '10ч', '2025-11-13 04:40:20'),
(889, 129, '2025-11-21', '14ч', '2025-11-13 04:40:20'),
(890, 129, '2025-11-25', '10ч', '2025-11-13 04:40:20'),
(891, 129, '2025-11-26', '14ч', '2025-11-13 04:40:20'),
(892, 129, '2025-11-30', '10ч', '2025-11-13 04:40:20'),
(893, 123, '2025-11-01', '10ч', '2025-11-13 04:40:22'),
(894, 123, '2025-11-02', '14ч', '2025-11-13 04:40:22'),
(895, 123, '2025-11-06', '10ч', '2025-11-13 04:40:22'),
(896, 123, '2025-11-07', '14ч', '2025-11-13 04:40:22'),
(897, 123, '2025-11-11', '10ч', '2025-11-13 04:40:22'),
(898, 123, '2025-11-12', '14ч', '2025-11-13 04:40:22'),
(899, 123, '2025-11-16', '10ч', '2025-11-13 04:40:22'),
(900, 123, '2025-11-17', '14ч', '2025-11-13 04:40:22'),
(901, 123, '2025-11-21', '10ч', '2025-11-13 04:40:22'),
(902, 123, '2025-11-22', '14ч', '2025-11-13 04:40:22'),
(903, 123, '2025-11-26', '10ч', '2025-11-13 04:40:22'),
(904, 123, '2025-11-27', '14ч', '2025-11-13 04:40:22'),
(905, 126, '2025-11-02', '10ч', '2025-11-13 04:40:23'),
(906, 126, '2025-11-03', '14ч', '2025-11-13 04:40:23'),
(907, 126, '2025-11-07', '10ч', '2025-11-13 04:40:23'),
(908, 126, '2025-11-08', '14ч', '2025-11-13 04:40:23'),
(909, 126, '2025-11-12', '10ч', '2025-11-13 04:40:23'),
(910, 126, '2025-11-13', '14ч', '2025-11-13 04:40:23'),
(911, 126, '2025-11-17', '10ч', '2025-11-13 04:40:23'),
(912, 126, '2025-11-18', '14ч', '2025-11-13 04:40:23'),
(913, 126, '2025-11-22', '10ч', '2025-11-13 04:40:23'),
(914, 126, '2025-11-23', '14ч', '2025-11-13 04:40:23'),
(915, 126, '2025-11-27', '10ч', '2025-11-13 04:40:23'),
(916, 126, '2025-11-28', '14ч', '2025-11-13 04:40:23'),
(917, 127, '2025-11-03', '10ч', '2025-11-13 04:40:23'),
(918, 127, '2025-11-04', '14ч', '2025-11-13 04:40:23'),
(919, 127, '2025-11-08', '10ч', '2025-11-13 04:40:23'),
(920, 127, '2025-11-09', '14ч', '2025-11-13 04:40:23'),
(921, 127, '2025-11-13', '10ч', '2025-11-13 04:40:23'),
(922, 127, '2025-11-14', '14ч', '2025-11-13 04:40:23'),
(923, 127, '2025-11-18', '10ч', '2025-11-13 04:40:23'),
(924, 127, '2025-11-19', '14ч', '2025-11-13 04:40:23'),
(925, 127, '2025-11-23', '10ч', '2025-11-13 04:40:23'),
(926, 127, '2025-11-24', '14ч', '2025-11-13 04:40:23'),
(927, 127, '2025-11-28', '10ч', '2025-11-13 04:40:23'),
(928, 127, '2025-11-29', '14ч', '2025-11-13 04:40:23'),
(929, 128, '2025-11-04', '10ч', '2025-11-13 04:40:23'),
(930, 128, '2025-11-05', '14ч', '2025-11-13 04:40:23'),
(931, 128, '2025-11-09', '10ч', '2025-11-13 04:40:23'),
(932, 128, '2025-11-10', '14ч', '2025-11-13 04:40:23'),
(933, 128, '2025-11-14', '10ч', '2025-11-13 04:40:23'),
(934, 128, '2025-11-15', '14ч', '2025-11-13 04:40:23'),
(935, 128, '2025-11-19', '10ч', '2025-11-13 04:40:24'),
(936, 128, '2025-11-20', '14ч', '2025-11-13 04:40:24'),
(937, 128, '2025-11-24', '10ч', '2025-11-13 04:40:24'),
(938, 128, '2025-11-25', '14ч', '2025-11-13 04:40:24'),
(939, 128, '2025-11-29', '10ч', '2025-11-13 04:40:24'),
(940, 128, '2025-11-30', '14ч', '2025-11-13 04:40:24'),
(941, 121, '2025-11-01', '14ч', '2025-11-13 04:40:24'),
(942, 121, '2025-11-05', '10ч', '2025-11-13 04:40:24'),
(943, 121, '2025-11-06', '14ч', '2025-11-13 04:40:24'),
(944, 121, '2025-11-10', '10ч', '2025-11-13 04:40:24'),
(945, 121, '2025-11-11', '14ч', '2025-11-13 04:40:24'),
(946, 121, '2025-11-15', '10ч', '2025-11-13 04:40:24'),
(947, 121, '2025-11-16', '14ч', '2025-11-13 04:40:24'),
(948, 121, '2025-11-20', '10ч', '2025-11-13 04:40:24'),
(949, 121, '2025-11-21', '14ч', '2025-11-13 04:40:24'),
(950, 121, '2025-11-25', '10ч', '2025-11-13 04:40:24'),
(951, 121, '2025-11-26', '14ч', '2025-11-13 04:40:24'),
(952, 121, '2025-11-30', '10ч', '2025-11-13 04:40:24'),
(953, 122, '2025-11-01', '10ч', '2025-11-13 04:40:24'),
(954, 122, '2025-11-02', '14ч', '2025-11-13 04:40:24'),
(955, 122, '2025-11-06', '10ч', '2025-11-13 04:40:24'),
(956, 122, '2025-11-07', '14ч', '2025-11-13 04:40:24'),
(957, 122, '2025-11-11', '10ч', '2025-11-13 04:40:24'),
(958, 122, '2025-11-12', '14ч', '2025-11-13 04:40:24'),
(959, 122, '2025-11-16', '10ч', '2025-11-13 04:40:24'),
(960, 122, '2025-11-17', '14ч', '2025-11-13 04:40:24'),
(961, 122, '2025-11-21', '10ч', '2025-11-13 04:40:24'),
(962, 122, '2025-11-22', '14ч', '2025-11-13 04:40:24'),
(963, 122, '2025-11-26', '10ч', '2025-11-13 04:40:24'),
(964, 122, '2025-11-27', '14ч', '2025-11-13 04:40:24'),
(965, 124, '2025-11-02', '10ч', '2025-11-13 04:40:25'),
(966, 124, '2025-11-03', '14ч', '2025-11-13 04:40:25'),
(967, 124, '2025-11-07', '10ч', '2025-11-13 04:40:25'),
(968, 124, '2025-11-08', '14ч', '2025-11-13 04:40:25'),
(969, 124, '2025-11-12', '10ч', '2025-11-13 04:40:25'),
(970, 124, '2025-11-13', '14ч', '2025-11-13 04:40:25'),
(971, 124, '2025-11-17', '10ч', '2025-11-13 04:40:25'),
(972, 124, '2025-11-18', '14ч', '2025-11-13 04:40:25'),
(973, 124, '2025-11-22', '10ч', '2025-11-13 04:40:25'),
(974, 124, '2025-11-23', '14ч', '2025-11-13 04:40:25'),
(975, 124, '2025-11-27', '10ч', '2025-11-13 04:40:25'),
(976, 124, '2025-11-28', '14ч', '2025-11-13 04:40:25'),
(977, 125, '2025-11-03', '10ч', '2025-11-13 04:40:25'),
(978, 125, '2025-11-04', '14ч', '2025-11-13 04:40:25'),
(979, 125, '2025-11-08', '10ч', '2025-11-13 04:40:25'),
(980, 125, '2025-11-09', '14ч', '2025-11-13 04:40:25'),
(981, 125, '2025-11-13', '10ч', '2025-11-13 04:40:25'),
(982, 125, '2025-11-14', '14ч', '2025-11-13 04:40:25'),
(983, 125, '2025-11-18', '10ч', '2025-11-13 04:40:25'),
(984, 125, '2025-11-19', '14ч', '2025-11-13 04:40:25'),
(985, 125, '2025-11-23', '10ч', '2025-11-13 04:40:25'),
(986, 125, '2025-11-24', '14ч', '2025-11-13 04:40:25'),
(987, 125, '2025-11-28', '10ч', '2025-11-13 04:40:25'),
(988, 125, '2025-11-29', '14ч', '2025-11-13 04:40:25'),
(989, 119, '2025-11-04', '10ч', '2025-11-13 04:40:25'),
(990, 119, '2025-11-05', '14ч', '2025-11-13 04:40:25'),
(991, 119, '2025-11-09', '10ч', '2025-11-13 04:40:25'),
(992, 119, '2025-11-10', '14ч', '2025-11-13 04:40:25'),
(993, 119, '2025-11-14', '10ч', '2025-11-13 04:40:25'),
(994, 119, '2025-11-15', '14ч', '2025-11-13 04:40:25'),
(995, 119, '2025-11-19', '10ч', '2025-11-13 04:40:25'),
(996, 119, '2025-11-20', '14ч', '2025-11-13 04:40:25'),
(997, 119, '2025-11-24', '10ч', '2025-11-13 04:40:26'),
(998, 119, '2025-11-25', '14ч', '2025-11-13 04:40:26'),
(999, 119, '2025-11-29', '10ч', '2025-11-13 04:40:26'),
(1000, 119, '2025-11-30', '14ч', '2025-11-13 04:40:26'),
(1001, 120, '2025-11-01', '14ч', '2025-11-13 04:40:26'),
(1002, 120, '2025-11-05', '10ч', '2025-11-13 04:40:26'),
(1003, 120, '2025-11-06', '14ч', '2025-11-13 04:40:26'),
(1004, 120, '2025-11-10', '10ч', '2025-11-13 04:40:26'),
(1005, 120, '2025-11-11', '14ч', '2025-11-13 04:40:26'),
(1006, 120, '2025-11-15', '10ч', '2025-11-13 04:40:26'),
(1007, 120, '2025-11-16', '14ч', '2025-11-13 04:40:26'),
(1008, 120, '2025-11-20', '10ч', '2025-11-13 04:40:26'),
(1009, 120, '2025-11-21', '14ч', '2025-11-13 04:40:26'),
(1010, 120, '2025-11-25', '10ч', '2025-11-13 04:40:26'),
(1011, 120, '2025-11-26', '14ч', '2025-11-13 04:40:26'),
(1012, 120, '2025-11-30', '10ч', '2025-11-13 04:40:26'),
(1013, 134, '2025-11-01', '10ч', '2025-11-13 04:40:29'),
(1014, 134, '2025-11-02', '10ч', '2025-11-13 04:40:29'),
(1015, 134, '2025-11-05', '10ч', '2025-11-13 04:40:29'),
(1016, 134, '2025-11-06', '10ч', '2025-11-13 04:40:29'),
(1017, 134, '2025-11-09', '10ч', '2025-11-13 04:40:29'),
(1018, 134, '2025-11-10', '10ч', '2025-11-13 04:40:29'),
(1019, 134, '2025-11-13', '10ч', '2025-11-13 04:40:29'),
(1020, 134, '2025-11-14', '10ч', '2025-11-13 04:40:29'),
(1021, 134, '2025-11-17', '10ч', '2025-11-13 04:40:29'),
(1022, 134, '2025-11-18', '10ч', '2025-11-13 04:40:29'),
(1023, 134, '2025-11-21', '10ч', '2025-11-13 04:40:29'),
(1024, 134, '2025-11-22', '10ч', '2025-11-13 04:40:29'),
(1025, 134, '2025-11-25', '10ч', '2025-11-13 04:40:29'),
(1026, 134, '2025-11-26', '10ч', '2025-11-13 04:40:29'),
(1027, 134, '2025-11-29', '10ч', '2025-11-13 04:40:29'),
(1028, 134, '2025-11-30', '10ч', '2025-11-13 04:40:29'),
(1029, 135, '2025-11-03', '10ч', '2025-11-13 04:40:30'),
(1030, 135, '2025-11-04', '10ч', '2025-11-13 04:40:30'),
(1031, 135, '2025-11-07', '10ч', '2025-11-13 04:40:30'),
(1032, 135, '2025-11-08', '10ч', '2025-11-13 04:40:30'),
(1033, 135, '2025-11-11', '10ч', '2025-11-13 04:40:30'),
(1034, 135, '2025-11-12', '10ч', '2025-11-13 04:40:30'),
(1035, 135, '2025-11-15', '10ч', '2025-11-13 04:40:30'),
(1036, 135, '2025-11-16', '10ч', '2025-11-13 04:40:30'),
(1037, 135, '2025-11-19', '10ч', '2025-11-13 04:40:30'),
(1038, 135, '2025-11-20', '10ч', '2025-11-13 04:40:30'),
(1039, 135, '2025-11-23', '10ч', '2025-11-13 04:40:30'),
(1040, 135, '2025-11-24', '10ч', '2025-11-13 04:40:30'),
(1041, 135, '2025-11-27', '10ч', '2025-11-13 04:40:30'),
(1042, 135, '2025-11-28', '10ч', '2025-11-13 04:40:30'),
(1157, 130, '2025-11-01', '10ч', '2025-11-13 04:56:11'),
(1158, 130, '2025-11-06', '10ч', '2025-11-13 04:56:11'),
(1161, 130, '2025-11-11', '10ч', '2025-11-13 04:56:11'),
(1163, 130, '2025-11-16', '10ч', '2025-11-13 04:56:11'),
(1165, 130, '2025-11-21', '10ч', '2025-11-13 04:56:12'),
(1167, 130, '2025-11-26', '10ч', '2025-11-13 04:56:12'),
(1170, 130, '2025-11-02', '14ч', '2025-11-13 04:56:12'),
(1172, 130, '2025-11-07', '14ч', '2025-11-13 04:56:12'),
(1174, 130, '2025-11-12', '14ч', '2025-11-13 04:56:12'),
(1176, 130, '2025-11-17', '14ч', '2025-11-13 04:56:12'),
(1178, 130, '2025-11-22', '14ч', '2025-11-13 04:56:12'),
(1180, 130, '2025-11-27', '14ч', '2025-11-13 04:56:12');

-- --------------------------------------------------------

--
-- Структура таблицы `settings`
--

CREATE TABLE `settings` (
  `id` int NOT NULL,
  `key_name` varchar(50) NOT NULL,
  `value` json NOT NULL,
  `description` text,
  `updated_at` timestamp NULL DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;

-- --------------------------------------------------------

--
-- Структура таблицы `shifts`
--

CREATE TABLE `shifts` (
  `id` int NOT NULL,
  `employee_id` int NOT NULL,
  `date` date NOT NULL,
  `shift` varchar(10) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;

-- --------------------------------------------------------

--
-- Структура таблицы `vacation_requests`
--

CREATE TABLE `vacation_requests` (
  `id` int NOT NULL,
  `employee_id` int NOT NULL,
  `start_date` date NOT NULL,
  `end_date` date NOT NULL,
  `status` enum('pending','approved','rejected') DEFAULT 'pending',
  `created_at` timestamp NULL DEFAULT CURRENT_TIMESTAMP,
  `reviewed_by` int DEFAULT NULL,
  `reviewed_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;

-- --------------------------------------------------------

--
-- Структура таблицы `work_schedule`
--

CREATE TABLE `work_schedule` (
  `id` int NOT NULL,
  `employee_id` int NOT NULL,
  `date` date NOT NULL,
  `shift_type` enum('day','night','off') NOT NULL DEFAULT 'off'
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;

--
-- Индексы сохранённых таблиц
--

--
-- Индексы таблицы `employees`
--
ALTER TABLE `employees`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `phone` (`phone`);

--
-- Индексы таблицы `schedule`
--
ALTER TABLE `schedule`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `unique_day` (`employee_id`,`date`);

--
-- Индексы таблицы `settings`
--
ALTER TABLE `settings`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `key_name` (`key_name`);

--
-- Индексы таблицы `shifts`
--
ALTER TABLE `shifts`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `unique_day` (`employee_id`,`date`);

--
-- Индексы таблицы `vacation_requests`
--
ALTER TABLE `vacation_requests`
  ADD PRIMARY KEY (`id`),
  ADD KEY `employee_id` (`employee_id`),
  ADD KEY `reviewed_by` (`reviewed_by`);

--
-- Индексы таблицы `work_schedule`
--
ALTER TABLE `work_schedule`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `unique_date_employee` (`employee_id`,`date`);

--
-- AUTO_INCREMENT для сохранённых таблиц
--

--
-- AUTO_INCREMENT для таблицы `employees`
--
ALTER TABLE `employees`
  MODIFY `id` int NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=136;

--
-- AUTO_INCREMENT для таблицы `schedule`
--
ALTER TABLE `schedule`
  MODIFY `id` int NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=1201;

--
-- AUTO_INCREMENT для таблицы `settings`
--
ALTER TABLE `settings`
  MODIFY `id` int NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT для таблицы `shifts`
--
ALTER TABLE `shifts`
  MODIFY `id` int NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT для таблицы `vacation_requests`
--
ALTER TABLE `vacation_requests`
  MODIFY `id` int NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT для таблицы `work_schedule`
--
ALTER TABLE `work_schedule`
  MODIFY `id` int NOT NULL AUTO_INCREMENT;

--
-- Ограничения внешнего ключа сохраненных таблиц
--

--
-- Ограничения внешнего ключа таблицы `schedule`
--
ALTER TABLE `schedule`
  ADD CONSTRAINT `schedule_ibfk_1` FOREIGN KEY (`employee_id`) REFERENCES `employees` (`id`) ON DELETE CASCADE;

--
-- Ограничения внешнего ключа таблицы `shifts`
--
ALTER TABLE `shifts`
  ADD CONSTRAINT `shifts_ibfk_1` FOREIGN KEY (`employee_id`) REFERENCES `employees` (`id`) ON DELETE CASCADE;

--
-- Ограничения внешнего ключа таблицы `vacation_requests`
--
ALTER TABLE `vacation_requests`
  ADD CONSTRAINT `vacation_requests_ibfk_1` FOREIGN KEY (`employee_id`) REFERENCES `employees` (`id`) ON DELETE CASCADE,
  ADD CONSTRAINT `vacation_requests_ibfk_2` FOREIGN KEY (`reviewed_by`) REFERENCES `employees` (`id`) ON DELETE SET NULL;

--
-- Ограничения внешнего ключа таблицы `work_schedule`
--
ALTER TABLE `work_schedule`
  ADD CONSTRAINT `work_schedule_ibfk_1` FOREIGN KEY (`employee_id`) REFERENCES `employees` (`id`) ON DELETE CASCADE;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
